Revit 2026 API

# AnalyticalPowerDistributableNodeDataGetConnectedPhasesOnDownstream Method

---

Get the electrical connected phases of the downstream node.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElectricalConnectedPhases GetConnectedPhasesOnDownstream(
	ElementId id
)
```
```vb
Public Function GetConnectedPhasesOnDownstream (
	id As ElementId
) As ElectricalConnectedPhases
```
```cpp
public:
ElectricalConnectedPhases GetConnectedPhasesOnDownstream(
	ElementId^ id
)
```
```fsharp
member GetConnectedPhasesOnDownstream :
        id : ElementId -> ElectricalConnectedPhases
```

#### Parameters

id ElementId
     The downstream node id.

#### Return Value

ElectricalConnectedPhases The electrical connected phases of the downstream node.

| Exception | Condition |
| --- | --- |
| ArgumentException | The id isn't a downstream node id of the power distributable node. |
| ArgumentNullException | A non-optional argument was null |

If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B. Usually one node may have many downstream nodes, but TransferSwitch can only have one downstream node.

#### Reference

AnalyticalPowerDistributableNodeData Class

Autodesk.Revit.DB.Electrical Namespace